uhnp/src/InformationRegisters/РеквизитыПоУмолчаниюНалоговогоМониторинга/РеквизитыПоУмолчаниюНалоговогоМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыПоУмолчаниюНалоговогоМониторинга</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ГлаваНК</name>
    <type>
      <types>CatalogRef.УдалитьГлавыНалоговогоКодексаНалоговогоМониторинга</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьНалоговыйПериод</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>КодНалога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/Мероприятие/Мероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Мероприятие</name>
  <basedOn>Document.РисковоеСобытие</basedOn>
  <basedOn>Catalog.Риски</basedOn>
  <basedOn>Catalog.Цели</basedOn>
  <basedOn>Catalog.ЗакупочныеПроцедуры</basedOn>
  <registerRecords>InformationRegister.КонтекстыМероприятий</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаЛиквидациюРисков</registerRecords>
  <registerRecords>InformationRegister.ПрогрессСтадийМероприятий</registerRecords>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.Риски</types>
      <types>DocumentRef.РисковоеСобытие</types>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
      <types>CatalogRef.Цели</types>
      <types>DocumentRef.КритерииОценкиПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРеакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическиеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеакцииНаРисковоеСобытие</name>
    <type>
      <types>CatalogRef.ТипРеакцииНаРисковоеСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОРезультатах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Предписания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительПредписания</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьИсполненияПредписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийПрогресс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОфициальногоОбъявленияЗакупки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.СостоянияВыполненияКонтрольныхПроцедур</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Стадии</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.СтадииМероприятий</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРеакции</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановыеЗатратыСтадии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиеЗатратыСтадии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прогресс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапомнитьОСтадии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйСтадии</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>РезюмеСтадии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующаяСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеГруппы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВложения</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзШаблона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтекстыМероприятий</name>
    <attributes>
      <name>Контекст</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИтоговыеДокументы</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйДокумент</name>
      <type>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИтоговогоДокумента</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаФайл</name>
      <type>
        <types>CatalogRef.МероприятиеПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/CommonModules/ОбновлениеИнформационнойБазыНМ/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	Описание.Имя    = "НалоговыйМониторингБиблиотека";
	Описание.Версия = "4.0.4.292";
	Описание.ИдентификаторИнтернетПоддержки = ИнтернетПоддержкаПользователейУХ.ИмяПрограммыДляИдентификацииВСервисахИнтернетПоддержки();
	
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики=Неопределено) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыНМ.ЗаполнитьОснованияДляЗапросаНалоговогоМониторинга";
	Обработчик.Версия = "3.0.7.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b5f5beb6-ef4b-401d-8084-08b0a3cfbd0f");
	Обработчик.Комментарий = НСтр("ru = 'Заполняет основания налогового мониторинга.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.РасширенияПанелиНалоговогоМониторинга.ЗаполнитьПоставляемыеДанные";
	Обработчик.Версия = "3.1.0.156";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d4d92521-db91-4c4e-8e7e-015b4d07b0af");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение поставляемых контролей из шаблона.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыНМ.ЗаполнитьВидыЗапрашиваемойОтчетностиНалоговогоМониторинга2";
	Обработчик.Версия = "3.1.16.16";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("045ac38e-0596-4aab-8305-50ff532456ac");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение видов запрашиваемой отчетности для запросов НМ.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыНМ.ПереносПрисоединенныхФайлов";
	Обработчик.Версия = "3.2.5.5";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("610650b5-81d5-4b44-98a1-8eadbd54264c");
	Обработчик.Комментарий = НСтр("ru = 'Перенос данных архива файлов налогового мониторинга.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыНМ.ИзменениеРесурсаПериод";
	Обработчик.Версия = "3.2.6.85";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a297e48d-ca22-4843-9c29-59ceb6a6e8ab");
	Обработчик.Комментарий = НСтр("ru = 'Перенос данных периодов в настройках.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыНМ.ОбновлениеВложенийСтадий";
	Обработчик.Версия = "3.2.7.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ad314c97-59ab-4879-911b-5d58db7848c2");
	Обработчик.Комментарий = НСтр("ru = 'Обновление вложений в стадиях.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыНМ.ПереносФайловМероприятийВПрисоединенные";
	Обработчик.Версия = "3.2.7.1";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4e49f75c-15c1-414a-ac88-b234dda623d1");
	Обработчик.Комментарий = НСтр("ru = 'Перенос файлов в присоединённые.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыНМ.ЗаполнитьФункциональнуюОпциюВитрины";
	Обработчик.Версия = "4.0.1.5";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c6913a51-3ae6-4918-9f1f-0799c8edfb7c");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение функциональной опции витрины налогового мониторинга.'");
КонецПроцедуры

Процедура ПередОбновлениемИнформационнойБазы(Обработчики = Неопределено) Экспорт
	ВерсииПодсистем = ОбновлениеИнформационнойБазы.ВерсииПодсистем();
	СтрокаНМ = ВерсииПодсистем.Найти("НалоговыйМониторинг", "ИмяПодсистемы");
	СтрокаБиб = ВерсииПодсистем.Найти("НалоговыйМониторингБиблиотека", "ИмяПодсистемы");
	Если СтрокаНМ <> Неопределено И СтрокаБиб = Неопределено Тогда
		ОбновлениеИнформационнойБазы.ЗарегистрироватьНовуюПодсистему("НалоговыйМониторингБиблиотека", СтрокаНМ.Версия);
		ВерсииПодсистем = ОбновлениеИнформационнойБазы.ВерсииПодсистем();
		СтрокаНМ = ВерсииПодсистем.Найти("НалоговыйМониторинг", "ИмяПодсистемы");
		ВерсииПодсистем.Удалить(СтрокаНМ);
		ОбновлениеИнформационнойБазы.УстановитьВерсииПодсистем(ВерсииПодсистем);
	КонецЕсли;
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, 
	Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	Если ПредыдущееИмяКонфигурации = "БухгалтерияПредприятияКОРП" Тогда
		Параметры.ОчиститьСведенияОПредыдущейКонфигурации = Ложь;
	КонецЕсли;
КонецПроцедуры

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ЗаполнитьВидыЗапрашиваемойОтчетностиНалоговогоМониторинга2(Параметры = Неопределено) Экспорт
	Макет = Справочники.ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга.ПолучитьМакет("МакетЗаполнения");
	Инд = 2;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга КАК ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга";
	
	РезультатЗапроса = Запрос.Выполнить();
	ЭтоОбновление = НЕ РезультатЗапроса.Пустой();

	Пока ЭтоОбновление Цикл
		Код = Макет.Область(Инд, 1, Инд, 1).Текст;
		Инд = Инд + 1;
		Если ПустаяСтрока(Код) Тогда
			Прервать;
		КонецЕсли;
		Ссылка = Справочники.ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга.НайтиПоКоду(Код);
		Если Ссылка.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		НовОбъект = Ссылка.ПолучитьОбъект();
		НовОбъект.ПометкаУдаления = Истина;
		Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НовОбъект);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Макет = Справочники.ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга.ПолучитьМакет("Классификатор");
	Инд = 2;
	Пока Истина Цикл
		Код = Макет.Область(Инд, 1, Инд, 1).Текст;
		Если ПустаяСтрока(Код) Тогда
			Прервать;
		КонецЕсли;
		Наименование = Макет.Область(Инд, 2, Инд, 2).Текст;
		Ссылка = Справочники.ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга.НайтиПоКоду(Код);
		Если Ссылка.Пустая() Тогда
			НовОбъект = Справочники.ВидыЗапрашиваемойОтчетностиНалоговогоМониторинга.СоздатьЭлемент();
		Иначе
			НовОбъект = Ссылка.ПолучитьОбъект();
		КонецЕсли;
		НовОбъект.Код = Код;
		НовОбъект.Наименование = Наименование;
		Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НовОбъект);
		Исключение
		КонецПопытки;
		Инд = Инд + 1;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьОснованияДляЗапросаНалоговогоМониторинга(Параметры = Неопределено) Экспорт
	Макет = Справочники.ОснованияДляЗапросаНалоговогоМониторинга.ПолучитьМакет("МакетЗаполнения");
	Инд = 2;
	Пока Истина Цикл
		Код = Макет.Область(Инд, 1, Инд, 1).Текст;
		Если ПустаяСтрока(Код) Тогда
			Прервать;
		КонецЕсли;
		Наименование = Макет.Область(Инд, 2, Инд, 2).Текст;
		Ссылка = Справочники.ОснованияДляЗапросаНалоговогоМониторинга.НайтиПоКоду(Код);
		Если Ссылка.Пустая() Тогда
			НовОбъект = Справочники.ОснованияДляЗапросаНалоговогоМониторинга.СоздатьЭлемент();
		Иначе
			НовОбъект = Ссылка.ПолучитьОбъект();
		КонецЕсли;
		НовОбъект.Код = Код;
		НовОбъект.Наименование = Наименование;
		Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НовОбъект);
		Исключение
		КонецПопытки;
		Инд = Инд + 1;
	КонецЦикла;
КонецПроцедуры

Процедура ПереносПрисоединенныхФайлов(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизацииУдалитьПубликуемыеФайлыНалоговогоМониторинга.Файл КАК Файл
		|ИЗ
		|	Справочник.Организации.УдалитьПубликуемыеФайлыНалоговогоМониторинга КАК ОрганизацииУдалитьПубликуемыеФайлыНалоговогоМониторинга";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект = ВыборкаДетальныеЗаписи.Файл.ПолучитьОбъект();
		Объект.ОтображаетсяВНалоговомМониторинге = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	КонецЦикла;

КонецПроцедуры

Процедура ИзменениеРесурсаПериод(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеквизитыПоУмолчаниюНалоговогоМониторинга.Период КАК Период,
		|	РеквизитыПоУмолчаниюНалоговогоМониторинга.Пользователь КАК Пользователь,
		|	РеквизитыПоУмолчаниюНалоговогоМониторинга.УдалитьНалоговыйПериод КАК НалоговыйПериод
		|ИЗ
		|	РегистрСведений.РеквизитыПоУмолчаниюНалоговогоМониторинга КАК РеквизитыПоУмолчаниюНалоговогоМониторинга";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Менеджер = РегистрыСведений.РеквизитыПоУмолчаниюНалоговогоМониторинга.СоздатьМенеджерЗаписи();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Менеджер.Период = ВыборкаДетальныеЗаписи.Период;
		Менеджер.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
		Менеджер.Прочитать();
		Менеджер.НачалоПериода = Менеджер.УдалитьНалоговыйПериод.ДатаНачала;
		Менеджер.ОкончаниеПериода = Менеджер.УдалитьНалоговыйПериод.ДатаОкончания;
		Менеджер.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереносФайловМероприятийВПрисоединенные(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Мероприятие.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Мероприятие КАК Мероприятие";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СоответствиеФайлам = РаботаСФайлами.СконвертироватьФайлыВПрисоединенные(ВыборкаДетальныеЗаписи.Ссылка);
		Для каждого Строка Из Объект.Стадии Цикл
			Строка.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			Вложения = Строка.УдалитьВложения.Получить();
			Если ТипЗнч(Вложения) = Тип("ТаблицаЗначений") Тогда
				Для каждого Строка2 Из Вложения Цикл
					НоваяСтрока = Объект.ИтоговыеДокументы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка2);
					НоваяСтрока.ИдентификаторСтроки = Строка.ИдентификаторСтроки;
					Если ЗначениеЗаполнено(Строка2.ИДФайла) Тогда
						Файл = Справочники.Файлы.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка2.ИДФайла));
						НоваяСтрока.СсылкаНаФайл = СоответствиеФайлам.Получить(Файл);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеВложенийСтадий(Параметры = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииМероприятийТипыИтоговыхДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтадииМероприятий.ТипыИтоговыхДокументов КАК СтадииМероприятийТипыИтоговыхДокументов
		|ГДЕ
		|	НЕ(СтадииМероприятийТипыИтоговыхДокументов.УдалитьТипИтоговогоДокумента = ЗНАЧЕНИЕ(Справочник.СправочникиБД.ПустаяСсылка)
		|				ИЛИ СтадииМероприятийТипыИтоговыхДокументов.УдалитьТипИтоговогоДокумента = ЗНАЧЕНИЕ(Справочник.ДокументыБД.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	СтадииМероприятийТипыИтоговыхДокументов.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Для каждого Стр Из Объект.ТипыИтоговыхДокументов Цикл
			Если НЕ ЗначениеЗаполнено(Стр.УдалитьТипИтоговогоДокумента) Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Стр.УдалитьТипИтоговогоДокумента) = Тип("СправочникСсылка.СправочникиБД") Тогда
				Стр.ТипИтоговогоДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник." + Стр.УдалитьТипИтоговогоДокумента.Наименование, Ложь);
			ИначеЕсли ТипЗнч(Стр.УдалитьТипИтоговогоДокумента) = Тип("СправочникСсылка.ДокументыБД") Тогда
				Стр.ТипИтоговогоДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ." + Стр.УдалитьТипИтоговогоДокумента.Наименование, Ложь);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Стр.ТипИтоговогоДокумента) Тогда
				ЗаписьЖурналаРегистрации("Обновление.СтадииМероприятий", УровеньЖурналаРегистрации.Предупреждение, , ВыборкаДетальныеЗаписи.Ссылка, "В ограничениях типа вложения стадии мероприятия указан несуществующий объект метаданных " + Стр.УдалитьТипИтоговогоДокумента.Наименование);
			КонецЕсли;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьФункциональнуюОпциюВитрины(Параметры = Неопределено) Экспорт
	Константы.ВитринаНалоговогоМониторинга.Установить(Истина);
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыФункцииДляИспользованияВОбработчикахОбновления

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для использования в обработчиках обновления.

// Записывает изменения в переданном объекте.
// Для использования в обработчиках обновления.
//
// Параметры:
//   Данные                            - Произвольный - объект, набор записей или менеджер константы, который
//                                                      необходимо записать.
//   РегистрироватьНаУзлахПлановОбмена - Булево       - включает регистрацию на узлах планов обмена при записи объекта.
//   ВключитьБизнесЛогику              - Булево       - включает бизнес-логику при записи объекта.
//
Процедура ЗаписатьДанные(Знач Данные, Знач РегистрироватьНаУзлахПлановОбмена = Ложь, 
	Знач ВключитьБизнесЛогику = Ложь) Экспорт
	
	Данные.ОбменДанными.Загрузка = Не ВключитьБизнесЛогику;
	Если Не РегистрироватьНаУзлахПлановОбмена Тогда
		Данные.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		Данные.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	КонецЕсли;
	
	Данные.Записать();
	
КонецПроцедуры

// Записывает изменения в переданном объекте ссылочного типа.
// Для использования в обработчиках обновления.
//
// Параметры:
//   Объект                            - Произвольный - записываемый объект ссылочного типа. Например, СправочникОбъект.
//   РегистрироватьНаУзлахПлановОбмена - Булево       - включает регистрацию на узлах планов обмена при записи объекта.
//   ВключитьБизнесЛогику              - Булево       - включает бизнес-логику при записи объекта.
//
Процедура ЗаписатьОбъект(Знач Объект, Знач РегистрироватьНаУзлахПлановОбмена = Неопределено, 
	Знач ВключитьБизнесЛогику = Ложь) Экспорт
	
	Если РегистрироватьНаУзлахПлановОбмена = Неопределено И Объект.ЭтоНовый() Тогда
		РегистрироватьНаУзлахПлановОбмена = Истина;
	Иначе
		РегистрироватьНаУзлахПлановОбмена = Ложь;
	КонецЕсли;
	
	Объект.ОбменДанными.Загрузка = Не ВключитьБизнесЛогику;
	Если Не РегистрироватьНаУзлахПлановОбмена Тогда
		Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	КонецЕсли;
	
	Объект.Записать();
	
КонецПроцедуры

#КонецОбласти
